Процедуры:

1. 
Вх: Номер заказа
Рассчитать стоимость заказа: вся продукция, топпинги
Включить запись в таблицу
При добавлении нового заказа: рассчитать стоимость заказа и сформировать (или обновить) чек

2. 

Оформление заказа
Вх : номер заказа, информация о продукции, количество, ФИО клиента
Вых: Если номер заказа пустой, то формируется новый заказ и в строке заказа появляется запись
Если сущетсвует, то проверяю принадлежность Клиенту -> вставляются только строки заказа
Если в заказе были включены товары, а клиент хочет изменить заказ, то для существующего заказа -> Обновляет данные

